quapik/DP_git/board/pin_mux.c
    /* PORTB2 (pin 37) is configured as TPM2_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_MOTOR_PWM2_PORT, BOARD_INITPINS_MOTOR_PWM2_PIN, kPORT_MuxAlt3);

    /* PORTB3 (pin 38) is configured as TPM2_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_MOTOR_PWM1_PORT, BOARD_INITPINS_MOTOR_PWM1_PIN, kPORT_MuxAlt3);

    /* PORTC0 (pin 43) is configured as ADC0_SE14 */
    PORT_SetPinMux(BOARD_INITPINS_IR_sensor_PORT, BOARD_INITPINS_IR_sensor_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC1 (pin 44) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_SW3_PORT, BOARD_INITPINS_SW3_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC1 (pin 44): Interrupt on falling edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_SW3_PORT, BOARD_INITPINS_SW3_PIN, kPORT_InterruptFallingEdge);

    /* PORTC10 (pin 55) is configured as PTC10 */
    PORT_SetPinMux(BOARD_INITPINS_HALL1_PORT, BOARD_INITPINS_HALL1_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC10 (pin 55): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_HALL1_PORT, BOARD_INITPINS_HALL1_PIN, kPORT_InterruptRisingEdge);

    /* PORTC4 (pin 49) is configured as SPI0_PCS0 */
    PORT_SetPinMux(BOARD_INITPINS_SPI0_CS0_PORT, BOARD_INITPINS_SPI0_CS0_PIN, kPORT_MuxAlt2);

    /* PORTC5 (pin 50) is configured as SPI0_SCK */
    PORT_SetPinMux(BOARD_INITPINS_SPI0_SCK_PORT, BOARD_INITPINS_SPI0_SCK_PIN, kPORT_MuxAlt2);

    /* PORTC6 (pin 51) is configured as SPI0_MOSI */
    PORT_SetPinMux(PORTC, 6U, kPORT_MuxAlt2);

    /* PORTC7 (pin 52) is configured as SPI0_MISO */
    PORT_SetPinMux(PORTC, 7U, kPORT_MuxAlt2);

    /* PORTC8 (pin 53) is configured as PTC8 */
    PORT_SetPinMux(BOARD_INITPINS_SRF05_trigger1_PORT, BOARD_INITPINS_SRF05_trigger1_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 54) is configured as TPM0_CH5 */
    PORT_SetPinMux(PORTC, 9U, kPORT_MuxAlt3);

    /* PORTD0 (pin 57) is configured as PTD0 */
    PORT_SetPinMux(BOARD_INITPINS_tracker6_PORT, BOARD_INITPINS_tracker6_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD0 (pin 57): Interrupt on either edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_tracker6_PORT, BOARD_INITPINS_tracker6_PIN, kPORT_InterruptEitherEdge);

    /* PORTD1 (pin 58) is configured as PTD1 */
    PORT_SetPinMux(BOARD_INITPINS_tracker5_PORT, BOARD_INITPINS_tracker5_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD1 (pin 58): Interrupt on either edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_tracker5_PORT, BOARD_INITPINS_tracker5_PIN, kPORT_InterruptEitherEdge);

    /* PORTD2 (pin 59) is configured as PTD2 */
    PORT_SetPinMux(BOARD_INITPINS_tracker4_PORT, BOARD_INITPINS_tracker4_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD2 (pin 59): Interrupt on either edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_tracker4_PORT, BOARD_INITPINS_tracker4_PIN, kPORT_InterruptEitherEdge);

    /* PORTD3 (pin 60) is configured as PTD3 */
    PORT_SetPinMux(BOARD_INITPINS_tracker3_PORT, BOARD_INITPINS_tracker3_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD3 (pin 60): Interrupt on either edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_tracker3_PORT, BOARD_INITPINS_tracker3_PIN, kPORT_InterruptEitherEdge);

    /* PORTD4 (pin 61) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INITPINS_tracker2_PORT, BOARD_INITPINS_tracker2_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD4 (pin 61): Interrupt on either edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_tracker2_PORT, BOARD_INITPINS_tracker2_PIN, kPORT_InterruptEitherEdge);

    /* PORTD5 (pin 62) is configured as PTD5 */
    PORT_SetPinMux(BOARD_INITPINS_tracker1_PORT, BOARD_INITPINS_tracker1_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD5 (pin 62): Interrupt on either edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_tracker1_PORT, BOARD_INITPINS_tracker1_PIN, kPORT_InterruptEitherEdge);

    /* PORTE0 (pin 1) is configured as LPUART1_TX */
    PORT_SetPinMux(PORTE, 0U, kPORT_MuxAlt3);

    /* PORTE1 (pin 2) is configured as LPUART1_RX */
    PORT_SetPinMux(PORTE, 1U, kPORT_MuxAlt3);

    /* PORTE16 (pin 8) is configured as UART2_TX */
    PORT_SetPinMux(PORTE, 16U, kPORT_MuxAlt3);

    /* PORTE24 (pin 20) is configured as TPM0_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_TPM0_CH0_PORT, BOARD_INITPINS_TPM0_CH0_PIN, kPORT_MuxAlt3);

    /* PORTE25 (pin 21) is configured as TPM0_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_TPM0_CH1_PORT, BOARD_INITPINS_TPM0_CH1_PIN, kPORT_MuxAlt3);

    /* PORTE31 (pin 19) is configured as TPM0_CH4 */
    PORT_SetPinMux(PORTE, 31U, kPORT_MuxAlt3);

    SIM->SOPT4 = ((SIM->SOPT4 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT4_TPM1CH0SRC_MASK | SIM_SOPT4_TPM2CH0SRC_MASK)))

                  /* TPM1 channel 0 input capture source select: TPM1_CH0 signal. */
                  | SIM_SOPT4_TPM1CH0SRC(SOPT4_TPM1CH0SRC_TPM1_CH0)

                  /* TPM2 Channel 0 Input Capture Source Select: TPM2_CH0 signal. */
                  | SIM_SOPT4_TPM2CH0SRC(SOPT4_TPM2CH0SRC_TPM2_CH0));

    SIM->SOPT5 =
        ((SIM->SOPT5 &
          /* Mask bits to zero which are setting */
          (~(SIM_SOPT5_LPUART0TXSRC_MASK | SIM_SOPT5_LPUART0RXSRC_MASK | SIM_SOPT5_LPUART1TXSRC_MASK | SIM_SOPT5_LPUART1RXSRC_MASK)))

         /* LPUART0 Transmit Data Source Select: LPUART0_TX pin. */
         | SIM_SOPT5_LPUART0TXSRC(SOPT5_LPUART0TXSRC_LPUART_TX)

         /* LPUART0 Receive Data Source Select: LPUART_RX pin. */
         | SIM_SOPT5_LPUART0RXSRC(SOPT5_LPUART0RXSRC_LPUART_RX)

         /* LPUART1 Transmit Data Source Select: LPUART1_TX pin. */
         | SIM_SOPT5_LPUART1TXSRC(SOPT5_LPUART1TXSRC_LPUART_TX)

         /* LPUART1 Receive Data Source Select: LPUART1_RX pin. */
         | SIM_SOPT5_LPUART1RXSRC(SOPT5_LPUART1RXSRC_LPUART_RX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
